
# 回调函数： 了解
#   把函数当作参数传入另一个函数中


# sort(key=)
list1 = [
    {'name': '张三', 'age': 18, 'score': 50, 'tel': 18866669999, 'sex': '不明'},
    {'name': '李四', 'age': 16, 'score': 88, 'tel': 18866668998, 'sex': '男'},
    {'name': '王五', 'age': 17, 'score': 48, 'tel': 18866667995, 'sex': '女'},
    {'name': '陈一军', 'age': 61, 'score': 59, 'tel': 18866669998, 'sex': '不明'},
    {'name': '陈二军', 'age': 49, 'score': 88, 'tel': 18866669396, 'sex': '男'},
    {'name': '陈三军', 'age': 49, 'score': 61, 'tel': 18866668994, 'sex': '女'}
]

list2 = [
    ('张三', 18),
    ('李四', 16),
    ('王五', 17),
    ('陈一军', 61),
    ('陈二军', 49),
    ('陈三军', 48)
]


