
# 类和对象
#   类是对象的抽象，class, 同一类事物的统称
#   对象是类的具体，object, 需要通过类来创建
#
#   类：不占内存
#   对象：占内存，不同对象占不同内存

#   类          对象
#   人          我
#  电脑       你的那台华为电脑
#  华为电脑   你的那台华为电脑
#  男朋友     你的男朋友



# 自定义类
#   所有的类都会继承object



# 一个类可以创建任意多个对象
# 比如：工厂生产华为手机的模型就是类
#      生产的每一部具体的手机就是一个对象


# 练习
# 1.创建Phone类
#      属性：color, size, price
#      方法：call, play_game, chat




# 2.小美在朝阳公园溜旺财【注：旺财是狗】
#   类People：
#       属性：姓名 name
#       方法：溜旺财 walk_dog
#            def walk_dog(self, place, dog_name):
#                   小美 在 朝阳公园 溜 旺财


